import profile

year = int(input('Високосный ли год: '))  #80
if year % 4 == 0 and (year % 100 != 0 or year % 400 == 0):  #265+313+313 = 289
    print('Год високосный')#38
else:
    print('Год не високосный')#42

    # Итого 1051


year = int(input('Високосный ли год: ')) #80
if year % 4 != 0: #265
    print("Год не високосный")   #42
elif year % 100 != 0:  #37+4+200+16*3 + 24 = 313
    if year % 400 == 0:    #37+4+200+16*3 + 24 = 313
        print("Год високосный")  #38
    else:
        print("Год не високосный")#42
else:
    print("Год високосный")#38

    # Итого 1131

profile.run('main()')

# 64-разрядная операционная система, процессор x64
# python 3.9